Autodesk.Revit.DB.FailureProcessingResult
Enum represents result of failure processing by FailuresPreprocessor, handler of FailuresProcessing event or
by FailuresProcessor.
Remarks:
The ability to return certain values may be restricted for certain methods or for certain contexts.
Since:
2011

Autodesk.Revit.DB.FailureProcessingResult.WaitForUserInput
Can be returned only by FailuresProcessor if it is waiting for external event (typically user input) to complete failures processing.

Autodesk.Revit.DB.FailureProcessingResult.ProceedWithRollBack
Should be returned if transaction was requested to be committed and failure (pre)processor requires it to be rolled back instead.
If before ProceedWithRollBack is returned FailureHandlingOptions are set to clear errors after rollback,
no further error processing will take place, all failures will be deleted and transaction is rolled back silently.
Otherwise default failure processing will continue, failures may be delivered to the user, but transaction is guaranteed to be rolled back.

Autodesk.Revit.DB.FailureProcessingResult.ProceedWithCommit
Should be returned if some failures were resolved and instructs failure processing/transaction mechanism to try to repeat end of transaction checks
and commit transaction again.
There is no guarantee that such commit will succeed.
"ProceedWithCommit" cannot be returned if transaction is already being rolled back, and will be treated as "ProceedWithRollBack" in this case.

Autodesk.Revit.DB.FailureProcessingResult.Continue
Should be returned if no action was taken and/or caller should continue with default failure processing.
If FailuresProcessor returns "Continue" with unresolved failures, Revit will instead act as if "ProceedWithRollBack" was returned.